{
    "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#deviceAppManagement/mobileApps/$entity",
    "@odata.type": "#microsoft.graph.win32LobApp",
    "id": "7de5453a-838e-47cc-a1b2-76029efc588d",
    "displayName": "Remote Help",
    "description": "Windows Remote Help",
    "publisher": "Microsoft",
    "largeIcon": null,
    "createdDateTime": "2022-01-12T12:11:10.8679782Z",
    "lastModifiedDateTime": "2022-01-12T12:11:10.8679782Z",
    "isFeatured": true,
    "privacyInformationUrl": "",
    "informationUrl": "https://docs.microsoft.com/en-us/mem/intune/remote-actions/remote-help",
    "owner": "",
    "developer": "Microsoft",
    "notes": "",
    "uploadState": 1,       
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [
        "0"
    ],
    "dependentAppCount": 0,        
    "committedContentVersion": "1",
    "fileName": "RemotehelpInstaller.intunewin",
    "size": 4220544,
    "installCommandLine": "RemotehelpInstaller.exe /install /quiet acceptTerms=Yes",
    "uninstallCommandLine": "RemotehelpInstaller.exe /uninstall /quiet acceptTerms=Yes",
    "applicableArchitectures": "x64",
    "minimumFreeDiskSpaceInMB": null,
    "minimumMemoryInMB": null,
    "minimumNumberOfProcessors": null,
    "minimumCpuSpeedInMHz": null,
    "msiInformation": null,
    "setupFilePath": "RemotehelpInstaller.exe",
    "minimumSupportedWindowsRelease": "1607",
    "minimumSupportedOperatingSystem": {
        "v8_0": false,
        "v8_1": false,
        "v10_0": false,
        "v10_1607": true,
        "v10_1703": false,
        "v10_1709": false,
        "v10_1803": false,
        "v10_1809": false,
        "v10_1903": false
    },
    "detectionRules": [
        {
            "type": "#microsoft.graph.win32LobAppFileSystemDetection",
            "ruleType": "detection",
            "path": "C:\\Program Files\\Remote help",
            "detectionType": "version",
            "operator": "greaterThanOrEqual",
            "detectionValue": "10.0.10011.16385",
            "fileOrFolderName": "RemoteHelp.exe",
            "check32BitOn64System": false
        }
    ],
    "requirementRules": [],
    "rules": [
        {
            "@odata.type": "#microsoft.graph.win32LobAppFileSystemRule",
            "ruleType": "detection",
            "path": "C:\\Program Files\\Remote help",
            "fileOrFolderName": "RemoteHelp.exe",
            "operationType": "version",
            "operator": "greaterThanOrEqual",
            "comparisonValue": "10.0.10011.16384",
            "check32BitOn64System": false
        }
    ],
    "installExperience": {
        "runAsAccount": "system",
        "deviceRestartBehavior": "allow"
    },
    "returnCodes": [
        {
            "returnCode": 0,
            "type": "success"
        },
        {
            "returnCode": 1707,
            "type": "success"
        },
        {
            "returnCode": 3010,
            "type": "softReboot"
        },
        {
            "returnCode": 1641,
            "type": "hardReboot"
        },
        {
            "returnCode": 1618,
            "type": "retry"
        }
    ]
}