{
    "@odata.type":  "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id":  "af4abfba-10d3-4504-b193-abd4569475be",
    "lastModifiedDateTime":  "2020-10-05T11:17:28.5317669Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  false,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2020-05-07T08:15:50.7283245Z",
	"displayName":  "Windows Update Pilot Ring",
    "version":  2,
    "deliveryOptimizationMode@odata.type":  "#microsoft.graph.windowsDeliveryOptimizationMode",
    "deliveryOptimizationMode":  "userDefined",
    "prereleaseFeatures@odata.type":  "#microsoft.graph.prereleaseFeatures",
    "prereleaseFeatures":  "userDefined",
    "automaticUpdateMode@odata.type":  "#microsoft.graph.automaticUpdateMode",
    "automaticUpdateMode":  "autoInstallAtMaintenanceTime",
    "microsoftUpdateServiceAllowed":  true,
    "driversExcluded":  false,
    "qualityUpdatesDeferralPeriodInDays":  2,
    "featureUpdatesDeferralPeriodInDays":  5,
    "qualityUpdatesPaused":  false,
    "featureUpdatesPaused":  false,
    "qualityUpdatesPauseExpiryDateTime@odata.type":  "#DateTimeOffset",
    "qualityUpdatesPauseExpiryDateTime":  "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime@odata.type":  "#DateTimeOffset",
    "featureUpdatesPauseExpiryDateTime":  "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly@odata.type":  "#microsoft.graph.windowsUpdateType",
    "businessReadyUpdatesOnly":  "businessReadyOnly",
    "skipChecksBeforeRestart":  false,
    "updateWeeks":  null,
    "qualityUpdatesPauseStartDate":  null,
    "featureUpdatesPauseStartDate":  null,
    "featureUpdatesRollbackWindowInDays":  10,
    "qualityUpdatesWillBeRolledBack":  false,
    "featureUpdatesWillBeRolledBack":  false,
    "qualityUpdatesRollbackStartDateTime@odata.type":  "#DateTimeOffset",
    "qualityUpdatesRollbackStartDateTime":  "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime@odata.type":  "#DateTimeOffset",
    "featureUpdatesRollbackStartDateTime":  "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays":  null,
    "engagedRestartSnoozeScheduleInDays":  null,
    "engagedRestartTransitionScheduleInDays":  null,
    "deadlineForFeatureUpdatesInDays":  5,
    "deadlineForQualityUpdatesInDays":  2,
    "deadlineGracePeriodInDays":  7,
    "postponeRebootUntilAfterDeadline":  true,
    "autoRestartNotificationDismissal@odata.type":  "#microsoft.graph.autoRestartNotificationDismissalMethod",
    "autoRestartNotificationDismissal":  "notConfigured",
    "scheduleRestartWarningInHours":  null,
    "scheduleImminentRestartWarningInMinutes":  null,
    "userPauseAccess@odata.type":  "#microsoft.graph.enablement",
    "userPauseAccess":  "enabled",
    "userWindowsUpdateScanAccess@odata.type":  "#microsoft.graph.enablement",
    "userWindowsUpdateScanAccess":  "enabled",
    "updateNotificationLevel@odata.type":  "#microsoft.graph.windowsUpdateNotificationDisplayOption",
    "updateNotificationLevel":  "defaultNotifications",
    "allowWindows11Upgrade":  false,
    "installationSchedule":  {
                                 "@odata.type":  "#microsoft.graph.windowsUpdateActiveHoursInstall",
                                 "activeHoursStart@odata.type":  "#TimeOfDay",
                                 "activeHoursStart":  "08:00:00.0000000",
                                 "activeHoursEnd@odata.type":  "#TimeOfDay",
                                 "activeHoursEnd":  "17:00:00.0000000"
	}
}	