{
    "displayName":  "Endpoint Security - Windows Security Baseline",
    "description":  "",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "TemplateDisplayName":  "MDM Security Baseline for Windows 10 and later for November 2021",
    "TemplateId":  "034ccd46-190c-4afc-adf1-ad7cc11262eb",
    "versionInfo":  "November 2021",
    "settingsDelta":  [
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "af1d7d04-8d7a-42fc-8192-dc17f07a0ed2",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_lockScreenActivateAppsWithVoice",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "7d7e0896-4fa2-4a53-9fdc-c1517af920c2",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_lockScreenBlockToastNotifications",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "c2753235-572a-4e16-a604-a8b214ca79ae",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_accountLogonAuditCredentialValidation",
                              "valueJson":  "\"successAndFailure\"",
                              "value":  "successAndFailure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "43700c32-2b5b-421a-ab55-7b478bd1b249",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_accountLogonAuditKerberosAuthenticationService",
                              "valueJson":  "\"none\"",
                              "value":  "none"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "495bb9fc-2e08-4eb3-b2cb-74814918e18c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditAccountLockout",
                              "valueJson":  "\"failure\"",
                              "value":  "failure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "c15f51fe-6843-46d4-9112-d41a6170a036",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditGroupMembership",
                              "valueJson":  "\"success\"",
                              "value":  "success"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "f4bc5e8b-9b09-4418-9388-bcde45bebb68",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditLogon",
                              "valueJson":  "\"successAndFailure\"",
                              "value":  "successAndFailure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "f20b82ea-24d5-47e8-a470-07b34143ea10",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditOtherLogonLogoffEvents",
                              "valueJson":  "\"successAndFailure\"",
                              "value":  "successAndFailure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "7c2680c7-ab68-4008-9879-8fd6196ad60d",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditSpecialLogon",
                              "valueJson":  "\"success\"",
                              "value":  "success"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "5dea2713-a902-4c62-a710-0c90ebfb763c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_accountManagementAuditSecurityGroupManagement",
                              "valueJson":  "\"success\"",
                              "value":  "success"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "2fb435a6-a9ca-4ef5-b63c-bba8ffcfbdc9",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_accountManagementAuditUserAccountManagement",
                              "valueJson":  "\"successAndFailure\"",
                              "value":  "successAndFailure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "45475ccf-e131-4905-8ddf-f0adb4936d12",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_detailedTrackingAuditPNPActivity",
                              "valueJson":  "\"success\"",
                              "value":  "success"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "135ea1d1-a459-4b54-8b95-891be54bb77b",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_detailedTrackingAuditProcessCreation",
                              "valueJson":  "\"success\"",
                              "value":  "success"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "50d8b95d-2751-4afd-86b1-f1036bab80a4",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditDetailedFileShare",
                              "valueJson":  "\"failure\"",
                              "value":  "failure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "34a2e992-cd7f-4623-bb31-2e8eebeff1db",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditFileShare",
                              "valueJson":  "\"successAndFailure\"",
                              "value":  "successAndFailure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "6ddadbf7-724b-4d8b-89b6-2ee41490e9c9",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditOtherObjectAccessEvents",
                              "valueJson":  "\"successAndFailure\"",
                              "value":  "successAndFailure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "bff2bf3d-16b0-482f-b14b-c5db5bdb8523",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditRemovableStorage",
                              "valueJson":  "\"successAndFailure\"",
                              "value":  "successAndFailure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "084373b0-7268-4783-9a0c-d0ccf6028490",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditAuthenticationPolicyChange",
                              "valueJson":  "\"success\"",
                              "value":  "success"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "a5c30be7-1dd1-420d-897d-7106255a3a13",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditMPSSVCRuleLevelPolicyChange",
                              "valueJson":  "\"successAndFailure\"",
                              "value":  "successAndFailure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "4716f921-f09c-4c74-8d2b-389da9465748",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditOtherPolicyChangeEvents",
                              "valueJson":  "\"failure\"",
                              "value":  "failure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1699b0fd-e512-408c-8481-23c6ac04402c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditPolicyChange",
                              "valueJson":  "\"success\"",
                              "value":  "success"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "75b0b3ed-dcb1-49a4-bb8a-67e9eca9be96",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_privilegeUseAuditSensitivePrivilegeUse",
                              "valueJson":  "\"successAndFailure\"",
                              "value":  "successAndFailure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "472d298b-eb8f-4138-85d6-34f1bb6135af",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_systemAuditOtherSystemEvents",
                              "valueJson":  "\"successAndFailure\"",
                              "value":  "successAndFailure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "67d88138-8ce6-486f-a9c6-7db0f86efd16",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_systemAuditSecurityStateChange",
                              "valueJson":  "\"success\"",
                              "value":  "success"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "87008470-babc-4019-a5ce-5b95d7622a6b",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_systemAuditSecuritySystemExtension",
                              "valueJson":  "\"success\"",
                              "value":  "success"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "673b6ff6-5104-4301-8f65-94f15513924e",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_systemAuditSystemIntegrity",
                              "valueJson":  "\"successAndFailure\"",
                              "value":  "successAndFailure"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "169954b1-0904-4001-a163-621f4f7b0170",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardSecureBootWithDMA",
                              "valueJson":  "\"withoutDMA\"",
                              "value":  "withoutDMA"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "70b5ce82-69c4-4585-8b04-d5ee0335ffb0",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardEnableVirtualizationBasedSecurity",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "e4e22948-7c43-4aa6-a6be-7a1a0fa4b522",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLaunchSystemGuard",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "12ea6959-2a95-4e03-81b0-c097d42d9198",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings",
                              "valueJson":  "\"enableWithUEFILock\"",
                              "value":  "enableWithUEFILock"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "ee5ba262-9e39-462e-8633-bfd23afb4af1",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_appManagementMSIAlwaysInstallWithElevatedPrivileges",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "78abbc6c-9396-4e60-aa07-3160d3a64b88",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_appManagementMSIAllowUserControlOverInstall",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "10c3c815-803b-4208-97e9-0764544750ab",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_gameDvrBlocked",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "7d6a754b-6f03-4a39-b59e-4943e544f0b2",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdobeReaderLaunchChildProcess",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1ecc8b80-68fd-41fc-93aa-3b56ab5c2ea0",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeCommunicationAppsLaunchChildProcess",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "503749a7-5fd8-460b-ac5f-d9ebc5036f2e",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderSignatureUpdateIntervalInHours",
                              "valueJson":  "4",
                              "value":  4
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "b904115e-65d0-40ae-a0b3-021b3340e0b9",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderScanType",
                              "valueJson":  "\"quick\"",
                              "value":  "quick"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1f9e0af5-8f8d-489b-a613-faf2c7fa9151",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderScheduleScanDay",
                              "valueJson":  "\"everyday\"",
                              "value":  "everyday"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "d49f8c5c-a0d9-4b73-95d6-85307f2d7968",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderScheduledScanTime",
                              "valueJson":  "\"notConfigured\"",
                              "value":  "notConfigured"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "87e9531a-8d35-43ce-865b-c3b8be39d18c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderCloudBlockLevel",
                              "valueJson":  "\"notConfigured\"",
                              "value":  "notConfigured"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "c14446a3-bd78-4f10-a80a-5f3ed0c8723f",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderScanNetworkFiles",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "fa197b64-ef75-4bcf-a7c0-2d06ff477d5d",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderRequireRealTimeMonitoring",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "359855c1-6315-4260-8579-d4a703f0e7f0",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowScanScriptsLoadedInInternetExplorer",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "7f8d5fb9-756f-4fe9-bde3-31921ca5e3a9",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderScanArchiveFiles",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "809b32bc-bd3c-43ba-a8eb-4ed6a24385e5",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderRequireBehaviorMonitoring",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "afb86705-deb9-465c-a7f6-ad9f7db5605c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderRequireCloudProtection",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "edba1f79-571b-49bf-8afe-4cee31750265",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderScanIncomingMail",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "a90c088f-2ed0-484c-9b17-5580d09c6970",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderScanRemovableDrivesDuringFullScan",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "8d7c5ad0-3311-4ad3-8537-3a831cbd0d42",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsOtherProcessInjectionType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "ccc0c692-2d8d-4512-9970-9d76d6b27d17",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsExecutableContentCreationOrLaunchType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "26688756-106a-42df-bec0-e13adda276ab",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsLaunchChildProcessType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "3722788d-0fba-4c35-b859-8884db33966e",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeMacroCodeAllowWin32ImportsType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "6de88980-7aac-4df5-bb3b-50733d6afcf1",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptObfuscatedMacroCodeType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "9b9947f4-b73b-4cb3-b3f7-3a874478cf7a",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptDownloadedPayloadExecutionType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "30303403-0433-4641-94e2-e95ec5dc93dc",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderEmailContentExecutionType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "50a7c60f-a935-4981-9633-267e85e0be85",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderPreventCredentialStealingType",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "e2c096d2-ef7f-45c3-9caa-b75b369b9e08",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderPotentiallyUnwantedAppAction",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "574b7524-0e5f-4abf-901d-0ff15dcfae2a",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedUSBProcessType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "3b2d3bcd-477f-4008-a0a9-d59ab8bf231f",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderNetworkProtectionType",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "a1dafc0b-8b16-4d77-96c2-f88e0311a3bf",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderSubmitSamplesConsentType",
                              "valueJson":  "\"sendSafeSamplesAutomatically\"",
                              "value":  "sendSafeSamplesAutomatically"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "e56414eb-c36b-41ab-b9ab-cd4fb68a6a76",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenEnableInShell",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "0305bf87-87b7-445c-9878-4c9873322313",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenBlockOverrideForFiles",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
                              "id":  "280a4daa-3ef4-4d80-9cfe-7b818e6641b1",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityHardenedUncPaths",
                              "valueJson":  "{\"$implementationId\":\"deviceConfiguration--hardenedUncPathEnabled\",\"hardenedUncPaths\":[{\"serverPath\":\"\\\\\\\\*\\\\SYSVOL\",\"securityFlags\":[\"requireMutualAuthentication\",\"requireIntegrity\"]},{\"serverPath\":\"\\\\\\\\*\\\\NETLOGON\",\"securityFlags\":[\"requireMutualAuthentication\",\"requireIntegrity\"]}]}",
                              "implementationId":  "deviceConfiguration--hardenedUncPathEnabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1f7d0070-5a5c-4c40-8c99-ec03293af9c8",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityDownloadingOfPrintDriversOverHttp",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "5b6116aa-cf0f-41ea-937a-978d0e3e6381",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityInternetDownloadForWebPublishingAndOnlineOrderingWizards",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementCollectionSettingInstance",
                              "id":  "fc378a65-3f5f-4407-94a0-c2453684e3c2",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerEncryptionSupport",
                              "valueJson":  "[\"tls11\",\"tls12\"]"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "b13a6fb6-384f-4ff3-9397-fb96a5c2e59a",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerPreventManagingSmartScreenFilter",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "f670eb1b-3d87-4a82-9814-8ed0606bcfd4",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptActiveXControlsMarkedSafeForScripting",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "6c40a423-7c0c-40e6-a94c-a576a72846df",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneFileDownloads",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "71eaa14f-a727-4c47-8f78-6f07b34f0e8c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCertificateAddressMismatchWarning",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "5598dfa8-6e28-45bf-907a-ef7e2d7fd1e2",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerEnhancedProtectedMode",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "fb660c72-af4f-4608-a9ee-f22e9cc9548d",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerFallbackToSsl3",
                              "valueJson":  "\"noSites\"",
                              "value":  "noSites"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "bb23955d-2f4b-4155-8e30-dd048c6b57f3",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerSoftwareWhenSignatureIsInvalid",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "ba1f48d4-21ba-4021-b82c-3e9ee5694830",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCheckServerCertificateRevocation",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "68b0ce1e-c620-44d8-b1c6-4603b9f4c355",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCheckSignaturesOnDownloadedPrograms",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "20563780-530d-4bcd-86e2-fb5b0301e574",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesConsistentMimeHandling",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "9bf744f5-7fbd-4947-9d0d-02fcdff930c8",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerBypassSmartScreenWarnings",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "d7b9bdea-6953-495a-8e8f-127c81c16ecb",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerBypassSmartScreenWarningsAboutUncommonFiles",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "24b8dcae-7555-4799-b6d5-7744c3a5c2fd",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCrashDetection",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "6cce277b-390e-413e-b0e6-c3979497f9b2",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerDownloadEnclosures",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "8223cb95-b44f-4778-8611-9bb8e57597a5",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIgnoreCertificateErrors",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "c7952bff-1b55-4f0d-9ad1-b1cbe060196b",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerDisableProcessesInEnhancedProtectedMode",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "95e4655a-a28e-407c-8ead-73426a38fd47",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerSecuritySettingsCheck",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "6c04eea9-2e2f-4de6-bb60-4b127925de3b",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerActiveXControlsInProtectedMode",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "e6270d73-bb35-4b55-9ba7-246c48784659",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerUsersAddingSites",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "34262298-2bac-44f5-8825-d315c54b71bc",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerUsersChangingPolicies",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "04743b60-f781-4622-8eaf-1d8d85c34da3",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerBlockOutdatedActiveXControls",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "4e6aa762-fae9-4d0f-a1aa-2c0f76363c5c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIncludeAllNetworkPaths",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "cf2dc0e1-e6cb-43f3-86b3-49cdebb18543",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAccessToDataSources",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "f2a5a77a-3712-4822-acc1-f69403c24dd8",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAutomaticPromptForFileDownloads",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "5f41609f-71c1-45e4-90b8-cc4f09e9b762",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneCopyAndPasteViaScript",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "7cb16d1a-46ea-4e2c-9d5d-ccb537a0b502",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragAndDropOrCopyAndPasteFiles",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "5a1389b9-14cf-4368-b0b7-4111ac2e1b1e",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLessPrivilegedSites",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "87fdb8d6-cb35-4ba8-9ed5-376fbc9892c6",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLoadingOfXamlFiles",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "2a77787e-6bdc-42a6-b935-4c770e3c5bfb",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDotNetFrameworkReliantComponents",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "f1b02853-5b85-49c7-afcb-dceb20fce5ee",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowOnlyApprovedDomainsToUseActiveXControls",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "26fb63e0-07a5-4e22-adfa-26b49dd8277a",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowOnlyApprovedDomainsToUseTdcActiveXControls",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "0dd4d9d8-cf9e-4b04-aa45-39208dfb3216",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptingOfWebBrowserControls",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "985d1c93-4b27-4ae0-bb29-1f8307f8076d",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptInitiatedWindows",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "a48d98e9-ed14-49e3-9446-3d6b19e92cfc",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptlets",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "cbb6cf95-2d55-456e-9729-81b68e8cc630",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneSmartScreen",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "47e64571-6acf-4c7f-9b74-38739da152cb",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneUpdatesToStatusBarViaScript",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "dc5d7465-ead4-466c-868f-9a08bf3b162c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneUserDataPersistence",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "bd961c10-5810-4628-9a86-3b20db185941",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowVBScriptToRun",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "21cf0fcb-a364-49c4-ba74-5f41329fd13a",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDoNotRunAntimalwareAgainstActiveXControls",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "506806cf-6414-4ecd-8ca5-ea5b863a1364",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDownloadSignedActiveXControls",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "f253f5ca-7885-432e-bd4f-e9f178c7312c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDownloadUnsignedActiveXControls",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "762c5647-3ac5-42a7-b1b1-8a8bb3557858",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneCrossSiteScriptingFilter",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1d6ee762-aa1f-47da-9c2e-c42688024b4d",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragContentFromDifferentDomainsAcrossWindows",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "4b758df6-a22b-496f-a46a-83131ce6e52e",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragContentFromDifferentDomainsWithinWindows",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "3f3a6955-b105-43e0-a827-dbf2b3f2f2cf",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneProtectedMode",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "dd7dbfb6-98cd-41e1-a682-61e809cad762",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneIncludeLocalPathWhenUploadingFilesToServer",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "affd793b-02a4-4871-9f5e-1e1a783e1990",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "fff1d14b-69b9-4b33-98a7-b91ff375dcad",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneJavaPermissions",
                              "valueJson":  "\"disableJava\"",
                              "value":  "disableJava"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1489885c-5f38-40d7-a2db-6bdacbf60bda",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLaunchApplicationsAndFilesInAnIFrame",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "13028661-0bd7-4943-a9a7-229bebe97e75",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLogonOptions",
                              "valueJson":  "\"prompt\"",
                              "value":  "prompt"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "a371a7b6-9d2c-45ca-b80b-7601112abd36",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneNavigateWindowsAndFramesAcrossDifferentDomains",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "4183a0d8-b33d-459a-9497-7880eef0e42c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneRunDotNetFrameworkReliantComponentsSignedWithAuthenticode",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "0be76df7-4d74-481a-a1b8-b02ba4ac1c8d",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneSecurityWarningForPotentiallyUnsafeFiles",
                              "valueJson":  "\"prompt\"",
                              "value":  "prompt"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "010ca32a-2d55-454c-a20e-8c3f7e9384e8",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZonePopupBlocker",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "443feb21-8df3-42c4-810f-f69682fbec0f",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneDoNotRunAntimalwareAgainstActiveXControls",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "033abf6b-1ec0-44f8-b507-14b285ca86ba",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "75cf8fe0-3850-4eb8-8804-f5f9aaf81086",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneJavaPermissions",
                              "valueJson":  "\"highSafety\"",
                              "value":  "highSafety"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "9a5d531f-2f48-4dd2-bf69-d1255947bd47",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLocalMachineZoneDoNotRunAntimalwareAgainstActiveXControls",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "edd26db8-3db1-4cc2-8dd2-16d0f05acaeb",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLocalMachineZoneJavaPermissions",
                              "valueJson":  "\"disableJava\"",
                              "value":  "disableJava"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "cacbe942-1573-4981-a3ac-d66f869e551c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownInternetZoneSmartScreen",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "72a9d065-1fde-4858-8462-b7bc8d6497f2",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownIntranetZoneJavaPermissions",
                              "valueJson":  "\"disableJava\"",
                              "value":  "disableJava"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "29db8d55-f66f-464d-837d-5decbe15a663",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownLocalMachineZoneJavaPermissions",
                              "valueJson":  "\"disableJava\"",
                              "value":  "disableJava"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1b228240-c98a-469c-a0e0-d4712101943d",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownRestrictedZoneSmartScreen",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "40cdcc01-5968-4966-a7bc-849952f10baa",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownRestrictedZoneJavaPermissions",
                              "valueJson":  "\"disableJava\"",
                              "value":  "disableJava"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "01b1634e-6605-4ca8-8d38-f48aaaabfa19",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownTrustedZoneJavaPermissions",
                              "valueJson":  "\"disableJava\"",
                              "value":  "disableJava"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "13497dd1-0ca6-4c53-b372-1ee871a7024c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesMimeSniffingSafetyFeature",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "2fda52c1-8fb7-4ffb-8410-c5592bb050c9",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesMKProtocolSecurityRestriction",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "3b75b591-5a4b-4fac-b790-a2e7963412c3",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesNotificationBar",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1541d769-b1ec-4089-a783-1b3fa053c3dc",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerPreventPerUserInstallationOfActiveXControls",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "af9349d3-0a8d-4c1b-9dfe-42246e7c2eee",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesProtectionFromZoneElevation",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "39977200-82af-41ff-a282-6bb34455ecd1",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRemoveRunThisTimeButtonForOutdatedActiveXControls",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "8f150ce5-5bdb-45ad-9bc3-644130b8195d",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesRestrictActiveXInstall",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "0b7c83de-e76c-4acc-99e9-d49bd651c2fb",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAccessToDataSources",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1e38b22d-d409-4f3f-bcd9-ec21b971bd4b",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneActiveScripting",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "6cef1578-93c6-4da4-966b-806432dd791c",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAutomaticPromptForFileDownloads",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "12665ddb-3c89-45c3-b733-206d94ec3f31",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneBinaryAndScriptBehaviors",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "b865ebe2-5e2f-48e7-b620-6f6cbdd40f9b",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneCopyAndPasteViaScript",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "2ed587cf-bd86-465f-9a8d-254173acb300",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragAndDropOrCopyAndPasteFiles",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "dfd93447-a551-4024-88a9-030cd99ec23e",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLessPrivilegedSites",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "5eee6661-c7a4-45c5-8834-e6db584faa91",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLoadingOfXamlFiles",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "b5c5837f-cc87-4fb2-8d04-5a9405bd3665",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneMetaRefresh",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "3f1ca98a-c1c3-4f08-978b-bbbf609c1f07",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDotNetFrameworkReliantComponents",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "f75c4e59-9643-4f8b-9c0f-58ed3d1ff62f",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowOnlyApprovedDomainsToUseActiveXControls",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "f90d5187-5c82-4a76-a374-61bdea6a8e81",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowOnlyApprovedDomainsToUseTdcActiveXControls",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "ae368a08-532a-46bd-acd1-2b80b92ded11",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptingOfWebBrowserControls",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "5c279303-59ef-4376-be2c-70d070ace312",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptInitiatedWindows",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "a5ee0e61-4347-479f-89aa-be367ecacf7b",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptlets",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "be620b0d-c882-418f-863f-1cf95aeea030",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneSmartScreen",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "2b08dc69-3927-48a8-8608-a1cbd1b6f039",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneUpdatesToStatusBarViaScript",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "66f3461e-6c88-4cbd-8ab9-1e4cd22862d0",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneUserDataPersistence",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "ef2cadd9-d612-48a1-9932-8d3d5955b4c9",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowVBScriptToRun",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "0436a151-7d65-47fc-a4a3-6181b3a81167",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDoNotRunAntimalwareAgainstActiveXControls",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "5865e28d-3650-454d-944c-29286e427776",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDownloadSignedActiveXControls",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "73b57df4-0d20-4be4-b350-f1ca20a8d110",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDownloadUnsignedActiveXControls",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "83512c79-1575-46ef-bfed-d3741a003feb",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneCrossSiteScriptingFilter",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "c43b4093-b159-43e9-9dec-cdc38c27148d",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragContentFromDifferentDomainsAcrossWindows",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "90415124-21f7-4786-b046-12026e44ee64",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragContentFromDifferentDomainsWithinWindows",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "0794296e-21c6-4062-82d7-ea788e2f7547",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneIncludeLocalPathWhenUploadingFilesToServer",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "fb2c9f2e-7aed-42d3-8a37-4c9ff1c97396",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "3df90920-d378-4911-bda3-6aca6ff94a50",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneJavaPermissions",
                              "valueJson":  "\"disableJava\"",
                              "value":  "disableJava"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "29d5f78c-9b7d-47c1-a023-07d532d121bb",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLaunchApplicationsAndFilesInAnIFrame",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "641ac516-c7bb-48c1-9cce-f29cb4ce2e3b",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLogonOptions",
                              "valueJson":  "\"anonymous\"",
                              "value":  "anonymous"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1c2b4b23-b5fd-4fd5-8c0a-62496563773b",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneNavigateWindowsAndFramesAcrossDifferentDomains",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1b0a5c59-1fd4-4cf1-95b8-42435d43b5b6",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneRunActiveXControlsAndPlugins",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "a588be08-8cd0-41ca-bf21-f0351a9f6c59",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneRunDotNetFrameworkReliantComponentsSignedWithAuthenticode",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "98c05d9f-c5fa-44d3-b36f-8b78fc7cae8a",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptingOfJavaApplets",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "67f10732-6282-4d77-a564-f55c17799014",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneSecurityWarningForPotentiallyUnsafeFiles",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "46d7e362-d64d-4f33-b96f-b0c1de489878",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneProtectedMode",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "0aa36436-86d0-4c2a-b138-f451985883d2",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZonePopupBlocker",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "f243a63c-7615-4a35-8809-2f136fba9f95",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesRestrictFileDownload",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "8fc4aeb9-b32d-414b-ad4e-5fd85f522ff0",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesScriptedWindowSecurityRestrictions",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "e227169f-4b27-4e4f-bc9e-292b14367fbd",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerSecurityZonesUseOnlyMachineSettings",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "37e35704-2d12-401e-a248-3249f9cac8e4",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerUseActiveXInstallerService",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "34898ec2-eeb8-48de-844f-a6ac7af3f2c4",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneDoNotRunAntimalwareAgainstActiveXControls",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "60da3801-d6ef-4fae-9c0a-98b6e1dc2927",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
                              "valueJson":  "\"disable\"",
                              "value":  "disable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "da249d6e-2fcb-4a31-a9ca-bed93fdb2b75",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneJavaPermissions",
                              "valueJson":  "\"highSafety\"",
                              "value":  "highSafety"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "62fdabac-51fa-4f3a-92a0-6cf3227bf224",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetExplorerAutoComplete",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "37352c0b-daf2-45c3-a1e8-b6b7c1c9fb1a",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_dmaGuardDeviceEnumerationPolicy",
                              "valueJson":  "\"blockAll\"",
                              "value":  "blockAll"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
                              "id":  "bd78b503-03b7-4ba9-8cfb-f54d93752690",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteAssistanceSolicitedSetting",
                              "valueJson":  "{\"$implementationId\":\"deviceConfiguration--remoteAssistanceSolicitedSettingDisabled\"}",
                              "implementationId":  "deviceConfiguration--remoteAssistanceSolicitedSettingDisabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
                              "id":  "333bc188-6569-4347-be16-d53e04214250",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_hardwareDeviceInstallationBySetupClasses",
                              "valueJson":  "{\"$implementationId\":\"deviceConfiguration--hardwareDeviceInstallationBlocked\",\"removeMatchingHardwareDevices\":true,\"identifiers\":[\"{d48179be-ec20-11d1-b6b8-00c04fa372a7}\"]}",
                              "implementationId":  "deviceConfiguration--hardwareDeviceInstallationBlocked"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                              "id":  "de3c5537-65b3-443e-ad9f-f410f57da0c7",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomain",
                              "valueJson":  "{\"inboundConnectionsBlocked\":true,\"outboundConnectionsRequired\":true,\"inboundNotificationsBlocked\":true,\"firewallEnabled\":\"allowed\"}",
                              "value":  [
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                                                "id":  "0b9378c3-30da-4c53-832b-f65757342851",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_inboundConnectionsBlocked",
                                                "valueJson":  "true",
                                                "value":  true
                                            },
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                                                "id":  "11604f21-de3d-4da1-ae56-f07e3de08793",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_outboundConnectionsRequired",
                                                "valueJson":  "true",
                                                "value":  true
                                            },
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                                                "id":  "5caa5c55-97ac-4f40-a8f9-0fd7bddd3a73",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_inboundNotificationsBlocked",
                                                "valueJson":  "true",
                                                "value":  true
                                            },
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                                                "id":  "4b485a81-04dd-4125-8a49-60a8e086432c",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_firewallEnabled",
                                                "valueJson":  "\"allowed\"",
                                                "value":  "allowed"
                                            }
                                        ]
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                              "id":  "89f938b9-55de-430d-84e0-5e8cab8e8235",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivate",
                              "valueJson":  "{\"inboundConnectionsBlocked\":true,\"outboundConnectionsRequired\":true,\"inboundNotificationsBlocked\":true,\"firewallEnabled\":\"allowed\"}",
                              "value":  [
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                                                "id":  "5df639be-85ae-40f1-87be-1f3bad055617",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_inboundConnectionsBlocked",
                                                "valueJson":  "true",
                                                "value":  true
                                            },
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                                                "id":  "f9e5c82a-3a3c-4115-9d70-fd8bf1014b55",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_outboundConnectionsRequired",
                                                "valueJson":  "true",
                                                "value":  true
                                            },
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                                                "id":  "5a77a53c-a316-4c72-838e-83f31784f539",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_inboundNotificationsBlocked",
                                                "valueJson":  "true",
                                                "value":  true
                                            },
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                                                "id":  "7d841686-6cf2-41ce-bacd-028ff50bb577",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_firewallEnabled",
                                                "valueJson":  "\"allowed\"",
                                                "value":  "allowed"
                                            }
                                        ]
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                              "id":  "76627fa6-ef8c-452b-99bf-efede62302da",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublic",
                              "valueJson":  "{\"connectionSecurityRulesFromGroupPolicyNotMerged\":true,\"policyRulesFromGroupPolicyNotMerged\":true,\"inboundConnectionsBlocked\":true,\"outboundConnectionsRequired\":true,\"inboundNotificationsBlocked\":true,\"firewallEnabled\":\"allowed\"}",
                              "value":  [
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                                                "id":  "ba597537-8b2f-409e-acde-2bbe5b7cf112",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_connectionSecurityRulesFromGroupPolicyNotMerged",
                                                "valueJson":  "true",
                                                "value":  true
                                            },
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                                                "id":  "ec36c34c-f734-4c9e-bb8c-044ea09d7f06",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_policyRulesFromGroupPolicyNotMerged",
                                                "valueJson":  "true",
                                                "value":  true
                                            },
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                                                "id":  "7b2f0f53-e51b-4563-a638-3edd691e0ccd",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_inboundConnectionsBlocked",
                                                "valueJson":  "true",
                                                "value":  true
                                            },
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                                                "id":  "a8e8d0dc-fef4-469a-8086-d0824e8ab8fe",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_outboundConnectionsRequired",
                                                "valueJson":  "true",
                                                "value":  true
                                            },
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                                                "id":  "63354f53-7d09-4865-a3cb-71bc7cb31e2d",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_inboundNotificationsBlocked",
                                                "valueJson":  "true",
                                                "value":  true
                                            },
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                                                "id":  "429252e4-381b-432a-b201-df3313d34959",
                                                "definitionId":  "deviceConfiguration--windowsFirewallNetworkProfile_firewallEnabled",
                                                "valueJson":  "\"allowed\"",
                                                "value":  "allowed"
                                            }
                                        ]
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                              "id":  "426856b3-7298-403f-9530-dc882ee975f0",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy",
                              "valueJson":  "{\"requireEncryptionForWriteAccess\":true}",
                              "value":  [
                                            {
                                                "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                                                "id":  "8a6a84b5-1413-48ca-b8cb-1d77f55319f7",
                                                "definitionId":  "deviceConfiguration--bitLockerRemovableDrivePolicy_requireEncryptionForWriteAccess",
                                                "valueJson":  "true",
                                                "value":  true
                                            }
                                        ]
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "68726267-d79e-4544-b080-41f2a3b0dd02",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_searchDisableIndexingEncryptedItems",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "be139264-4100-45f8-a2c8-351fd612b4cf",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_passwordRequired",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "f8fe3830-da3e-4895-9b48-e820362633f6",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_passwordRequiredType",
                              "valueJson":  "\"alphanumeric\"",
                              "value":  "alphanumeric"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "0365622a-d10b-46dc-a41e-349617c07c8d",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_passwordExpirationDays",
                              "valueJson":  "60",
                              "value":  60
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "57e4ef46-fb95-4858-b5fc-d810d5192d70",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumCharacterSetCount",
                              "valueJson":  "3",
                              "value":  3
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "21c7fa5f-2d3e-4343-b42a-859d9711add2",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_passwordPreviousPasswordBlockCount",
                              "valueJson":  "24",
                              "value":  24
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "5bca6a33-705b-4a4c-b969-1211f3ac5917",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumLength",
                              "valueJson":  "8",
                              "value":  8
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "b26b39ba-5646-406d-a9bf-946fe18cf901",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_passwordSignInFailureCountBeforeFactoryReset",
                              "valueJson":  "10",
                              "value":  10
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "863e98a6-0fb3-406e-b97f-66c6af23d697",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumAgeInDays",
                              "valueJson":  "1",
                              "value":  1
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "aed6d637-562d-4659-a01e-f12e7e5a38be",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_passwordBlockSimple",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "cc51ffb7-822a-417d-bc73-da0c0ba91a19",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_lockScreenCamera",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "72eca62f-3f4b-47a2-97a4-5d20cb0dac19",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_lockScreenSlideShow",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "6550e9e1-f306-47c1-b19c-7d82ab9e80df",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_inkWorkspaceAccess",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "460a224d-b54b-4418-a1e0-b61d4c8304f1",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_powerShellShellScriptBlockLogging",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "53c1ee9d-f78f-4dfc-9294-cbaf72645f59",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_appsMicrosoftAccountsOptional",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "e8502520-49ca-4a67-ba9b-c8a32b91a74b",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_autoPlayDefaultAutoRunBehavior",
                              "valueJson":  "\"doNotExecute\"",
                              "value":  "doNotExecute"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "7e95b903-d472-4681-ae44-6e65b62082a4",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_autoPlayMode",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "e8cac271-29d6-4374-9742-330bf74dbbec",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_autoPlayForNonVolumeDevices",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "31691f8a-3029-47a9-a257-dc3576becde3",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_edgeBlockPasswordManager",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "bf0294b0-0b2a-4d39-9a85-15b2c371c6ae",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_edgeRequireSmartScreen",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "6c32b40a-8b77-41d4-b0b9-9f5b038267a0",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_smartScreenBlockPromptOverride",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "518b04ce-371f-4f23-b6bd-7dd8764d5e01",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_smartScreenBlockPromptOverrideForFiles",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "5540cd73-d12b-4a51-90ad-2b663967eb3d",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_edgePreventCertificateErrorOverride",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "a501d459-9b77-4f4d-8e1d-2ab1426e3cfe",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteHostDelegationOfNonExportableCredentials",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "08939fa2-434e-429e-800f-885897f6a0a0",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_credentialsUIEnumerateAdministrators",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "2376601b-5ab4-4784-a57a-42f999173b84",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_dataProtectionBlockDirectMemoryAccess",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "00eeac1c-94c9-4ff9-968e-ed9b2ee7672c",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceApplicationLogMaximumFileSizeInKb",
                              "valueJson":  "32768",
                              "value":  32768
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "b99b4a4a-4cee-43a3-a064-d988221ddfab",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceSystemLogMaximumFileSizeInKb",
                              "valueJson":  "32768",
                              "value":  32768
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "743d3dbe-feb4-4337-8f1a-7eb6e1893f40",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceSecurityLogMaximumFileSizeInKb",
                              "valueJson":  "196608",
                              "value":  196608
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "c14d22e0-7002-4d37-ac2e-eb84aef40650",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlocked",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "a03803ce-aaca-49af-ab82-636dff1dede3",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockThirdPartyNotifications",
                              "valueJson":  "false",
                              "value":  false
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "36963538-a403-492c-b40a-77c621a94daa",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockConsumerSpecificFeatures",
                              "valueJson":  "false",
                              "value":  false
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "e9378e2f-78b0-480e-be4a-22f27cada3c0",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_explorerDataExecutionPrevention",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "2c8a0c79-5363-4418-8ce8-400a98112f9d",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_explorerHeapTerminationOnCorruption",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "d91e0329-62c8-404e-8b97-89a72c367502",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsBlockRemoteLogonWithBlankPassword",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "c150a13f-391c-4fa9-a2e5-52c9a5861757",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMachineInactivityLimit",
                              "valueJson":  "15",
                              "value":  15
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "dedb9947-c1f6-4057-9e24-aadee76ce92b",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsSmartCardRemovalBehavior",
                              "valueJson":  "\"lockWorkstation\"",
                              "value":  "lockWorkstation"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "cb3f17c8-f781-4fdc-b02f-a40696b6ca73",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsClientDigitallySignCommunicationsAlways",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "a2d61abb-a592-4fad-ab3b-833267bf51f1",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsClientSendUnencryptedPasswordToThirdPartySMBServers",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "aae8fcc9-6a80-4d0a-8d5b-5994934bbcdd",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDisableServerDigitallySignCommunicationsAlways",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "5329077b-3f9b-4d93-b745-5be1e9da63b5",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDoNotAllowAnonymousEnumerationOfSAMAccounts",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "47413986-81af-41ae-84cf-630bb8a70435",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowAnonymousEnumerationOfSAMAccountsAndShares",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "92c69d12-69fa-436e-9512-f343c7174f01",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsRestrictAnonymousAccessToNamedPipesAndShares",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "27831ffe-2a7e-4b1b-99be-bafd7790b046",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowRemoteCallsToSecurityAccountsManager",
                              "valueJson":  "\"O:BAG:BAD:(A;;RC;;;BA)\"",
                              "value":  "O:BAG:BAD:(A;;RC;;;BA)"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "dc0f01c2-85dd-4440-8655-1e7e0cc9b8ea",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDoNotStoreLANManagerHashValueOnNextPasswordChange",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "8b56ea49-d099-4c21-b7cb-e25c50101720",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_lanManagerAuthenticationLevel",
                              "valueJson":  "\"lmNtlmV2AndNotLmOrNtm\"",
                              "value":  "lmNtlmV2AndNotLmOrNtm"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "d3757a0c-f28f-40d9-bd4d-839815f86441",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients",
                              "valueJson":  "\"ntlmV2And128BitEncryption\"",
                              "value":  "ntlmV2And128BitEncryption"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "078445ae-4194-4568-9e98-5ab0d7ca5eec",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers",
                              "valueJson":  "\"ntlmV2And128BitEncryption\"",
                              "value":  "ntlmV2And128BitEncryption"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "e41e4f0a-43e3-4c70-94e4-c94187005251",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAdministratorElevationPromptBehavior",
                              "valueJson":  "\"promptForConsentOnTheSecureDesktop\"",
                              "value":  "promptForConsentOnTheSecureDesktop"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "6914f670-3fb5-4954-b056-608b7ea3db64",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsStandardUserElevationPromptBehavior",
                              "valueJson":  "\"automaticallyDenyElevationRequests\"",
                              "value":  "automaticallyDenyElevationRequests"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "892028de-2495-4892-a4e4-37b82889e268",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDetectApplicationInstallationsAndPromptForElevation",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "1121b08b-1f88-4a50-bc60-cd1b6824591c",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowUIAccessApplicationsForSecureLocations",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "5c0bcb9b-96a1-44d1-bcfc-b50754a7331e",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsUseAdminApprovalModeForAdministrators",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "e354265d-eb5a-4eb4-a4c4-78ac27767e95",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsUseAdminApprovalMode",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "11c5fd4d-de29-42be-8161-9a390d77cd00",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "967ef78f-48d6-4303-ae47-c662622c2011",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideSmbV1ClientDriverStartConfiguration",
                              "valueJson":  "\"disableDriver\"",
                              "value":  "disableDriver"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "ea305f70-63f3-4591-9916-6438ece5132e",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideApplyUacRestrictionsToLocalAccountsOnNetworkLogon",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "7ae2085d-9536-4a30-ae2e-6ab8982f1eaa",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideStructuredExceptionHandlingOverwriteProtection",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "e999553f-0517-4017-be1d-ea32ae957ee8",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideSmbV1Server",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "4b66539f-7be2-481b-aad2-bbeb07f82a87",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideWDigestAuthentication",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "7aebb87d-4570-4075-baa8-9b4f433e52aa",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIpV6SourceRoutingProtectionLevel",
                              "valueJson":  "\"highestProtection\"",
                              "value":  "highestProtection"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "4c90354b-4b50-4719-84ae-0615259e1aca",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIpSourceRoutingProtectionLevel",
                              "valueJson":  "\"highestProtection\"",
                              "value":  "highestProtection"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "affc94a2-ef83-4768-b642-4ae2b94bd29b",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIgnoreNetBiosNameReleaseRequestsExceptFromWinsServers",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "93413832-53e8-4513-a26d-c62cc53f72a1",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIcmpRedirectsOverrideOspfGeneratedRoutes",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "905f265b-520b-46c7-8242-e1c9cfc19619",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_powerRequirePasswordOnWakeWhileOnBattery",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "bf24b74a-938e-4096-b20f-0b5cac1ee6d8",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_powerRequirePasswordOnWakeWhilePluggedIn",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "cde3683f-b801-489f-ac6e-af61715de30e",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_powerStandbyStatesWhenSleepingWhileOnBattery",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "6efcbb93-14c5-45a2-879b-8734bac35a47",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_powerStandbyStatesWhenSleepingWhilePluggedIn",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "ffc16ae1-68f7-4178-b7ce-7834b2c54400",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesClientConnectionEncryptionLevel",
                              "valueJson":  "\"high\"",
                              "value":  "high"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "5e46f4f3-5f86-4af7-9c78-df0333c9931a",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesDriveRedirection",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1735e2c0-f027-4f22-8cad-eae9c962e6b9",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesPasswordSaving",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "d549eb99-41b2-4716-84fe-7f1f576b3cc1",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesPromptForPasswordUponConnection",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "41b5512b-3e0c-4640-8e0b-76b772da9743",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesSecureRpcCommunication",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "8a13a333-a6b3-4810-bf2b-8116aab40821",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientDigestAuthentication",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "56f53782-bb85-4094-bee4-9d275c6cbdce",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceStoringRunAsCredentials",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "cf3a01e0-caf8-4492-9cdb-d10093534671",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientBasicAuthentication",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "1ce9e4ff-fec2-44e3-a596-509207c7c51e",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceBasicAuthentication",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "2bf7e381-9e71-42a7-ae1e-695f042915b8",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientUnencryptedTraffic",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "4c79bd4e-53e9-4054-a15f-70c5b0d044a3",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceUnencryptedTraffic",
                              "valueJson":  "\"disabled\"",
                              "value":  "disabled"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "8ed183d3-3f55-4c96-aa32-4e082b62fac4",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_rpcUnauthenticatedClientOptions",
                              "valueJson":  "\"authenticated\"",
                              "value":  "authenticated"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "4df98e1e-f518-46e6-962f-15b346551fd7",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_systemBootStartDriverInitialization",
                              "valueJson":  "\"goodUnknownAndBadButCritical\"",
                              "value":  "goodUnknownAndBadButCritical"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "2d44c9fe-5d8f-41db-807f-4088b31cf7f5",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_wiFiBlockAutomaticConnectHotspots",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "3f5c3dff-7a56-478f-a8c7-44a881dc02b5",
                              "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_internetSharingBlocked",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "bcc14504-c0d3-4777-afc6-f8c295e8a7b9",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_windowsConnectionManagerConnectionToNonDomainNetworks",
                              "valueJson":  "\"enabled\"",
                              "value":  "enabled"
                          }
                      ]
}
